{
  "resume": {
    "Experience": [
    {
      "Id" : "1",
      "Title": "Software Engineer Intern",
      "Company": "Ancestry",
      "Period": "6/13 - Present",
      "Reference": {
        "Name" : "Michael Murdock",
        "Email" : "mmurdock@ancestry.com"
      },
      "Messages": [
          "Created an archiving and file copying system that interfaced with OpenStack Swift",
          "Worked on a image editor using WPF and Pixel Shaders",
          "Created a website that consumed proprietary gridline processing data and displayed reports to administators"
        ]
    },
    {
      "Id" : "2",
      "Title": "Imaging Production Team Lead",
      "Company": "Ancestry",
      "Period": "4/12 - 6/13",
      "Reference": {
        "Name" : "Jeff Heaps",
        "Email" : "jheaps@ancestry.com"
      },
      "Messages": [
        "Developed a <a href='https://github.com/reedcwilson/SpecialistDashboard'>WPF application</a> for specialists to track images and statistical information using a SQL database",
        "Developed multiple WinForms applications to accomplish minor image processing and file manipulations",
        "Supported the office manager in maintaining the production floor",
        "Had many opportunities to train employees as well as give presentations",
        "Led the team in production numbers in addition to performing administrative tasks"
        ]
    },
    {
      "Id" : "3",
      "Title": "Imaging Specialist",
      "Company": "Ancestry",
      "Period": "8/11 - 4/12",
      "Reference": {
        "Name" : "Sally Trahan",
        "Email" : "sally.trahan@ancestry.com"
      },
      "Messages": [
        "Handled historical documents and images and prepared them for publishing",
        "Was the top image producer in the department and learned how to troubleshoot the hardware and the software"
        ]
    },
    {
      "Id" : "4",
      "Title": "Technical Support Agent",
      "Company": "Ancestry",
      "Period": "6/11 - 8/11",
      "Reference": {
        "Name" : "Joanne Buit",
        "Email" : "joanne.buit@ancestry.com"
      },
      "Messages": [
        "Became familiar with Ancestry products and supported customers having technical problems",
        "Learned more about Ancestry’s mission and gained insight into customers’ feelings about our products"
        ]
    }
    ],
      "Skills": {
        "Technologies": [
        { "Name": "C Languages",
          "Group": [
            { 
              "Name": "C",
              "Details": "My systems classes used <a href='http://en.wikipedia.org/wiki/C_(programming_language)'>C</a> at times. I am less familiar with C as I am C++ but feel comfortable enough in C to be competent."
            },
            { 
              "Name": "C++",
              "Details": "My beginner classes as well as my systems classes were all done in <a href='http://www.cplusplus.com/'>C++</a>. I am familiar with Makefiles, GCC and the object-oriented concepts as they are done in C++. I have no experience with the <a href='http://www.boost.org/'>Boost</a> library but am comfortable writing in C++."
            },
            { 
              "Name": "C#",
              "Details": "Ancestry uses <a href='http://msdn.microsoft.com/en-us/library/67ef8sbd.aspx'>C#</a> in almost all of its development. I am extremely familiar with <a href='http://msdn.microsoft.com/en-us/vstudio/aa718325.aspx'>Visual Studio</a> and would say that C# is my most comfortable language."
            },
            { 
              "Name": "Java",
              "Details": "My earlier classes used Java extensively and so I am familiar with <a href='http://www.oracle.com/technetwork/java/index-138747.html'>Java</a> though it is not a language I would choose to write a project in given the choice. I used <a href='https://www.jetbrains.com/idea/'>IntelliJ</a> as my default editor so I am comfortable with its environment."
            }
          ]
        },
        { "Name": "Web Technologies",
          "Group": [
            { 
              "Name": "AngularJS",
              "Details": "This website uses <a href='https://angularjs.org/'>AngularJS</a> as its front-end. I also wrote another site called <a href='http://broadcasts.reedcwilson.com'>broadcasts</a> using AngularJS."
            },
            { 
              "Name": "CSS",
              "Details": "I am most comfortable using CSS frameworks like <a href='http://getuikit.com/index.html'>UIKit</a> and <a href='http://getbootstrap.com/'>Twitter Bootstrap</a>. I can write plain CSS if needed but I use frameworks for my own work because of the ease-of-use and speed they provide. This site uses Twitter Bootstrap."
            },
            { 
              "Name": "HTML",
              "Details": "I am comfortable writing HTML and use it to <a href='https://support.google.com/webmasters/answer/6001095?hl=en'>describe</a> my page and not simply lay out the content the way I wish."
            },
            { 
              "Name": "JavaScript",
              "Details": "I have written multiple intranet sites used by Ancestry that have JavaScript functionality. I am most familiar with <a href='http://jquery.com/'>JQuery</a> to manipulate the DOM but have used plain JavaScript in some scenarios to accomplish certain UI tasks."
            }
          ]
        },
        { "Name": "Scripting Languages",
          "Group": [
            { 
              "Name": "Node.js",
              "Details": "This website uses a <a href='http://nodejs.org/'>Node.js</a> back-end web server which I wrote. I have also done some scripting in Node.js as well as a few other back-end servers for school and personal projects."
            },
            { 
              "Name": "Python",
              "Details": "Multiple classes I have taken were done primarily in <a href='https://www.python.org/'>Python</a>. I am quite comfortable in this language and have done extensive scripting."
            },
            { 
              "Name": "Ruby",
              "Details": "I have contributed to a <a href='https://www.ruby-lang.org/en/'>Ruby</a> open source project called <a href='https://github.com/dontangg/syrup'>syrup</a> which is used as a service to extract bank information. I have also done some minor scripting in Ruby."
            }
          ]
        },
        { "Name": "Database",
          "Group": [
            { 
              "Name": "MongoDB",
              "Details": "I have used <a href='http://www.mongodb.org/'>MongoDB</a> for school assignments as well as some personal projects. I have done two (<a href='https://drive.google.com/file/d/0B61tSETKk1a6LWY0STZFVGs5RG8/view?usp=sharing'>one</a>, and <a href='https://drive.google.com/file/d/0B61tSETKk1a6WVFCbDhfQ3A1S28/view?usp=sharing'>two</a>) in-depth research assignments on MongoDB and how it compares to other databases."
            },
            { 
              "Name": "MySQL",
              "Details": "Ancestry switched from SQL Server to <a href='http://www.mysql.com/'>MySQL</a> so I was able to learn about the differences between the two and how to interface with and use MySQL."
            },
            { 
              "Name": "SQLite",
              "Details": "I have used <a href='http://www.sqlite.org/'>SQLite</a> for quite a few personal projects. We also use SQLite at Ancestry as a way to send information back and forth between us and our vendors. We also built a recipe based system for managing operations performed on a collection of images."
            },
            { 
              "Name": "SQL Server",
              "Details": "I used this at Ancestry. All of the legacy data up until 2014 was stored in <a href='http://www.microsoft.com/en-us/server-cloud/products/sql-server/'>Microsoft SQL Server</a> instances."
            }
          ]
        },
        { "Name": "Process Management",
          "Group": [
            { 
              "Name": "Kanban",
              "Details": "I use <a href='http://kanbanblog.com/explained/'>Kanban</a> for my <a href='https://trello.com/'>personal projects</a> and the team projects I have done in school."
            },
            { 
              "Name": "Scrum",
              "Details": "I participated in a <a href='https://www.scrum.org/Resources/What-is-Scrum'>Scrum</a> team during my most recent time at Ancestry."
            }
          ]
        },
        { "Name": "Other",
          "Group": [
            { 
              "Name": "Git",
              "Details": "I use <a href='http://git-scm.com/'>Git</a> for all of my version control. I use it every day and manage my private repositories, which primarily consists of school assignments, on <a href='https://bitbucket.org/'>BitBucket</a> and host all of my other projects on <a href='https://bitbucket.org/'>GitHub</a>."
            },
            { 
              "Name": "OpenStack",
              "Details": "I created a file copying and management system that interfaces with an <a href='https://wiki.openstack.org/wiki/Swift'>OpenStack Swift</a> cluster. The system essentially allowed users to use the Swift cluster as if it were a file system."
            },
            {
              "Name": "WPF",
              "Details": "I have written quite a few applications using <a href='http://msdn.microsoft.com/en-us/library/aa970268%28v=vs.110%29.aspx'>WPF</a>. A couple of these have been very large scale applications and I would say that I am very proficient in writing WPF applications"
            }
          ]
        }]
      },
    "Education": [
    {
      "Id": "PGHS",
      "Institution": "Pleasant Grove High School",
      "Graduation": "April 2007",
      "ExtraCurricular": [
          "Chamber and A Cappella Choir",
          "Varsity Soccer Team"
        ]
    },
    {
      "Id": "BYU",
      "Institution": "Brigham Young University",
      "Graduation": "April 2015",
      "Specialization": [
        {
          "Name": "Major",
          "Details": {
            "Name": "Computer Science",
            "CourseGroup": [
              {
                "Name": "Math",
                "Courses": [
                  { 
                    "Name": "Algorithm Analysis",
                    "Details": "Discussed and implemented various algorithm strategies and the math behind them. We specifically implemented divide and conquer, linear programming, dynamic programming and various search algorithms."
                  },
                  { 
                    "Name": "Calculus 1 - Differential Calculus",
                    "Details": "Learned how to derive all linear and continuous equations."
                  },
                  {
                    "Name": "Calculus 2 - Integral Calculus",
                    "Details": "Learned various strategies for integration and also learned about common sequences and series."
                  },
                  {
                    "Name": "Computational and Probabilistic Models",
                    "Details": "Discussed the theory and history of computation. We learned about finite state machines, grammars, turing models, and algorithm complexity (specifically what makes something an NP problem vs a P problem."
                  },
                  {
                    "Name": "Discrete Structures and Mathematics",
                    "Details": "Learned boolean and relational algebra."
                  },
                  {
                    "Name": "Elementary Linear Algebra",
                    "Details": "Learned how to perform various operations on matricies and how to do proofs."
                  },
                  {
                    "Name": "Newtonian Mechanics",
                    "Details": "Experimented with and learned about basic Newtonian physics."
                  },
                  {
                    "Name": "Principles of Statistics",
                    "Details": "Learned the basics about statistics and what is required to perform a statistically sound study including the math required."
                  }
                ]
              },
              {
                "Name": "Software Engineering",
                "Courses": [
                  { 
                    "Name": "Advanced Programming Concepts",
                    "Details": "Was introduced to design patterns, made a medium scale program that interacted with a database and had a server and client architecture."
                  },
                  {
                    "Name": "Computer Systems",
                    "Details": "This was a systems class and introduced me to low-level machine architecture and programming. We programmed in assembler and C."
                  },
                  {
                    "Name": "Concepts of Programming Languages",
                    "Details": "Learned what features good programming languages possess. We implemented many aspects of a programming language such as the parser, closures, garbage collection and type checking."
                  },
                  {
                    "Name": "Data Structures",
                    "Details": "Was introduced to basic data structures and implemented many of them. We implemented linked lists, stacks, queues and binary search trees."
                  },
                  {
                    "Name": "Interactive Graphics and Image Processing",
                    "Details": "Learned about two-dimensional graphics programming."
                  },
                  {
                    "Name": "Internet Programming",
                    "Details": "Learned about the architecture of the Internet and implemented socket programs, basic web servers and then made a web site using modern design principles."
                  },
                  {
                    "Name": "Software Design and Testing",
                    "Details": "Implemented a large-scale version of the Settlers of Catan game as a web application while learning about design patterns and good testing practices."
                  },
                  {
                    "Name": "Software Engineering",
                    "Details": "Worked on a team that consisted of various jobs for everyone in the class. This simulated a real software development team including managers, developers, testers, and marketers."
                  }
                ]
              },
              {
                "Name": "Specialization and Electives",
                "Courses": [
                  { 
                    "Name": "Big Data Mining",
                    "Details": "Used Hadoop to perform data mining operations on massive data sets. Conducted a <a href='https://drive.google.com/file/d/0B61tSETKk1a6dzUtLVZPM3RtUGM/view?usp=sharing'>study</a> using data gathered from Steam's public API."
                  },
                  {
                    "Name": "Computer Communications and Networking",
                    "Details": "Learned about the Internet's architecture and implemented TCP."
                  },
                  {
                    "Name": "Computer Security",
                    "Details": "Learned about various encryption algorithms and about common computer vulnerabilities. Performed attacks on programs and systems that exhibit these vulnerabilities."
                  },
                  {
                    "Name": "Ethics and Computers in Society",
                    "Details": "Discussed the history of the Software Development industry and the ethics regarding various decisions that software professionals make."
                  },
                  {
                    "Name": "Introduction to Artificial Intelligence",
                    "Details": "Implemented several Artificial Intelligence algorithms and created AI bots that could compete in a simulated environment."
                  },
                  {
                    "Name": "Machine Learning and Data Mining",
                    "Details": "Learned about neural networks, decision trees, data mining and clustering."
                  },
                  {
                    "Name": "Technical Communication and Writing",
                    "Details": "Learned how to convey ideas and write in a technical setting. Conducted presentations and created users manuals for technical materials."
                  }
                ]
              }
            ]
          }
        },
        {
          "Name": "Minor",
          "Details": {
            "Name": "Business",
            "CourseGroup": [
              {
                "Name": "General",
                "Courses": [
                  { 
                    "Name": "Communication in an Organizational Setting",
                    "Details": "Learned about grammar usage and sentence structure to improve writing. Learned how to communicate in a professional setting."
                  },
                  {
                    "Name": "Economics: Principles and Problems",
                    "Details": "Learned the basic principles of macro and micro economics."
                  },
                  {
                    "Name": "Marketing Management",
                    "Details": "Discussed strategies for marketing products. We learned what large companies do to market as well as small start-ups."
                  },
                  {
                    "Name": "Principles of Accounting",
                    "Details": "Learned the basic principles of accounting including the formulae needed to perform basic accounting."
                  },
                  {
                    "Name": "Principles of Finance",
                    "Details": "Discussed corporate finances and learned about stocks, bonds, and annuities"
                  },
                  {
                    "Name": "Principles of Statistics",
                    "Details": "Learned the basics about statistics and what is required to perform a statistically sound study including the math required."
                  }
                ]
              }
            ]
          }
        }
      ]
    }
    ]
  }
}
